#+STARTUP: folded indent inlineimages latexpreview

* ={RGF}=

- R6 class での実装 (4 つのクラス)
  - Classifier x Regressor
  - RGF x FastRGF
    - FastRGF の方は、計算を簡易的にしてある。Feature Importance などは計算できない。

- Python パッケージの ={reticulate}= 版
#+begin_src R
pacman::p_funs(RGF)
#+end_src

#+RESULTS:
: [1] "FastRGF_Classifier"     "FastRGF_Regressor"      "mat_2scipy_sparse"     
: [4] "RGF_Classifier"         "RGF_cleanup_temp_files" "RGF_Regressor"         
: [7] "TO_scipy_sparse"

* Example

#+begin_src R
if (reticulate::py_available() && reticulate::py_module_available("rgf.sklearn")) {
  library(RGF)
  set.seed(1)
  x = matrix(runif(1000), nrow = 100, ncol = 10)
  y = runif(100)
  RGF_regr = RGF_Regressor$new(max_leaf = 50)
  RGF_regr$fit(x, y)
  preds = RGF_regr$predict(x)
  preds
}
#+end_src

#+RESULTS:
#+begin_example

  [1] 0.49904628 0.53054259 0.37823519 0.65015003 0.28237780 0.32578929
  [7] 0.42742188 0.67789300 0.81275145 0.56683717 0.86246630 0.44146534
 [13] 0.30966619 0.86912026 0.39423005 0.59233958 0.75937386 0.33769451
 [19] 0.17165301 0.29106848 0.19036818 0.84902767 0.30204687 0.79023824
 [25] 0.27223651 0.59376335 0.58293087 0.37368556 0.34517288 0.57162829
 [31] 0.50619602 0.52269530 0.47475714 0.81928324 0.71866106 0.28643596
 [37] 0.26419444 0.56782731 0.78763572 0.27805723 0.26434042 0.29344809
 [43] 0.60150748 0.49553377 0.23272578 0.32484645 0.56314727 0.31888084
 [49] 0.49268585 0.75377083 0.38022353 0.59131515 0.50944858 0.76051372
 [55] 0.69133149 0.38261791 0.61411388 0.34762013 0.49727026 0.34505810
 [61] 0.36096908 1.00266500 0.66689200 0.31784834 0.49545754 0.75716753
 [67] 0.38565739 0.33245540 0.82948434 0.41684414 0.33059278 0.08479362
 [73] 0.50730572 0.44180673 0.75747757 0.52189359 0.58720786 0.14495983
 [79] 0.47259584 0.40021364 0.33783650 0.37639006 0.59954268 0.11690545
 [85] 0.81996344 0.77367500 0.47221177 0.32773896 0.76009445 0.47126303
 [91] 0.45462108 0.65641926 0.30770253 0.35194861 0.59853740 0.75467860
 [97] 0.05136116 0.54359386 0.50476601 0.69662802
#+end_example

